Catalogs/ВерсииШаблоновHTML.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВерсииШаблоновHTML</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ШаблоныHTML</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстHTML</Name>
					<Comment>Строка, содержащая HTML-шаблон для подстановки в поля HTML-документов программы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидШаблона</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыШаблонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрируемыеЭлектронныеМедДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСЭМД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьШапкуШаблона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасположениеПодписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:EnumRef.РасположениеПодписи</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМедицинскойДокументации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМедицинскихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеФормироватьОтдельныйЭМД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьДиагнозыИзТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствияПараметрам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыHTML</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>localid</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлассификацияПоля</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнструментальныеИсследования</v8:Type>
								<v8:Type>cfg:CatalogRef.ЛабораторныеТесты</v8:Type>
								<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппирующееПоле</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыHTML</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъединяющееПоле</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыHTML</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеДляВрачаВОбъединяющемПоле</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоответствияТаблицамШаблонов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТаблицаШаблонов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТаблицыШаблоновПриема</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТаблицаОбработки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыHTML</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>localid</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлассификацияПоля</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнструментальныеИсследования</v8:Type>
								<v8:Type>cfg:CatalogRef.ЛабораторныеТесты</v8:Type>
								<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппирующееПоле</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыHTML</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокИзображений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзображениеBase64</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расширение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонстантыCDAДокумента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>localid</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПереченьВредныхФакторовИРабот</v8:Type>
								<v8:Type>cfg:CatalogRef.РолиПриПодписиМедДокументов</v8:Type>
								<v8:Type>cfg:CatalogRef.РеестрМедицинскихОрганизаций</v8:Type>
								<v8:Type>cfg:CatalogRef.ИнструментальныеИсследования</v8:Type>
								<v8:Type>cfg:CatalogRef.НоменклатураМедицинскихУслуг</v8:Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>cfg:CatalogRef.РегистрируемыеЭлектронныеМедДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.РеестрСтраховыхМедОрганизаций</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыМедицинскихДокументов</v8:Type>
								<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
								<v8:Type>cfg:CatalogRef.СтруктураПодразделений</v8:Type>
								<v8:Type>cfg:CatalogRef.РЭМДПравилаПодписи</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппирующееПоле</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыHTML</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлассификацияПоля</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнструментальныеИсследования</v8:Type>
								<v8:Type>cfg:CatalogRef.ЛабораторныеТесты</v8:Type>
								<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вычисляется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВычисляемоеЗначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВычисляемыеЗначенияПараметров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РолиПодписей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиПриПодписиМедДокументов</v8:Type>
								<v8:Type>cfg:EnumRef.РолиПодписей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимНастройкиДоступности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РежимыНастройкиДоступностиРоли</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакДоступностиРоли</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыHTML</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторРоли</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/РежимыНастройкиДоступностиРоли.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РежимыНастройкиДоступностиРоли</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АвторДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗначениеПараметра</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоступнаВсем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоступнаВсемКромеАвтора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МедицинскаяОрганизация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВерсииШаблоновHTML/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область РазделОписанияПеременных

&НаКлиенте
Перем соотвКешИзображенийШаблонов;

&НаКлиенте
Перем ДанныеТекущегоИнтерфейсаЗаполненияПараметров;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПравоДоступа("Редактирование", Метаданные.Справочники.ВерсииШаблоновHTML) Тогда
		Элементы.Дата.ТолькоПросмотр = Ложь;
		Элементы.НеИспользоватьШапкуШаблона.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	Для Каждого СтрокаРоли Из Объект.РолиПодписей Цикл
		Если СтрокаРоли.РежимНастройкиДоступности = Перечисления.РежимыНастройкиДоступностиРоли.ЗначениеПараметра Тогда
			СтрокаРоли.ПредставлениеНастройкаДоступности = СтрШаблон("%1: %2", СтрокаРоли.РежимНастройкиДоступности, СтрокаРоли.ПризнакДоступностиРоли);
		Иначе
			СтрокаРоли.ПредставлениеНастройкаДоступности = СтрокаРоли.РежимНастройкиДоступности;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СписокШаблонов = Новый Массив;
	СписокШаблонов.Добавить(Объект.Ссылка);
	РаботаСШаблонамиHTMLКлиентСервер.ИнициализироватьНастройкиИзображенийПриема(соотвКешИзображенийШаблонов, СписокШаблонов, ЭтаФорма.УникальныйИдентификатор);
	
	КодHTML.УстановитьТекст(Объект.ТекстHTML);
	
	ТекстHTMLПоУмолчанию = РаботаСШаблонамиHTMLКлиентСервер.ПолучитьТекстШаблонаHTMLПоУмолчанию();
	ДокументHTML = РаботаСDOMКлиентСервер.СоздатьДокументDOM(?(ПустаяСтрока(Объект.ТекстHTML), ТекстHTMLПоУмолчанию, Объект.ТекстHTML));
	ЗаполнитьСтраницыШаблонаПоДокументуHTML(ДокументHTML);
	УстановитьВидимостьКолонокСЭМД();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КонтекстноеМенюНастройкиПараметровИнтерфейса(Команда)
	
	Если ДанныеТекущегоИнтерфейсаЗаполненияПараметров = Неопределено
		Или Не ЗначениеЗаполнено(ДанныеТекущегоИнтерфейсаЗаполненияПараметров.Идентификатор)
	Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Идентификатор",				ДанныеТекущегоИнтерфейсаЗаполненияПараметров.Идентификатор);
	ПараметрыОткрытия.Вставить("ЗаголовокКнопки",			ДанныеТекущегоИнтерфейсаЗаполненияПараметров.ЗаголовокКнопки);
	ПараметрыОткрытия.Вставить("ТекущиеПараметры",			ДанныеТекущегоИнтерфейсаЗаполненияПараметров.ПараметрыПолей);
	ПараметрыОткрытия.Вставить("ТекущиеТаблицыПараметров",	ДанныеТекущегоИнтерфейсаЗаполненияПараметров.ТаблицыПараметров);
	
	ОткрытьФорму("Обработка.ИнтерфейсыЗаполненияПараметровШаблоновПриема.Форма.НастройкиЭлементаHTML", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПросмотрHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеТекущегоИнтерфейсаЗаполненияПараметров = Неопределено;
	
	Если ДанныеСобытия.Element.hasAttribute("bit-contextmenu-selectElement") Тогда
		ДанныеСобытия.Element.removeAttribute("bit-contextmenu-selectElement");
		ЗаполнитьПеременныеИнтерфейсовЗаполненияПараметров(ДанныеСобытия);
	КонецЕсли;
	
	УстановитьДоступностьКнопокКонтекстногоМенюПоляHTML();
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствияПараметрамПараметрНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьСтраницыШаблонаПоДокументуHTML(ДокументHTML, ОбновлятьИзображения = Истина)
	
	НеАктивизироватьСтрокуПараметра = Истина;
	
	Если ОбновлятьИзображения Тогда
		РаботаСШаблонамиHTMLКлиентСервер.ЗагрузитьИзображенияПриема(ДокументHTML, соотвКешИзображенийШаблонов, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
	УстановитьСкриптКонтекстногоМеню(ДокументHTML);
	ПросмотрHTML = РаботаСDOMКлиентСервер.ПолучитьТекстHTMLДокументаDOM(ДокументHTML);
	КодHTML.УстановитьТекст(РаботаСDOMКлиентСервер.ПолучитьКодТелаHTMLИзДокументаDOM(ДокументHTML));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКолонокСЭМД()
	
	ВидимостьЭлементовСЭМД = ЗначениеЗаполнено(Объект.ВидДокумента) И ФорматДокументаCDA(Объект.ВидДокумента);
	Элементы.СоответствияПараметрамlocalid.Видимость			= ВидимостьЭлементовСЭМД;
	Элементы.СоответствияПараметрамКлассификацияПоля.Видимость	= ВидимостьЭлементовСЭМД;
	Элементы.СоответствияПараметрамГруппирующееПоле.Видимость	= ВидимостьЭлементовСЭМД;
	Элементы.СоответствияПараметрамОбъединяющееПоле.Видимость	= ВидимостьЭлементовСЭМД;
	Элементы.ГруппаТаблицыСЭМД.Видимость						= ВидимостьЭлементовСЭМД;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ФорматДокументаCDA(ВидДокумента)
	Возврат ИнтеграцияЕГИСЗСервер.ПолучитьЗначениеАтрибутаЭлементаКлассификатора(ВидДокумента, "FORMAT") = "2";
КонецФункции

&НаКлиенте
Процедура УстановитьСкриптКонтекстногоМеню(ДокументHTML)
	
	Если ДокументHTML.Тело = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокументHTML.Тело.УстановитьАтрибут("oncontextmenu","contextMenuFunc(event)");
	ТекстСкрипта =
		"<script type='text/javascript'>
		|	function contextMenuFunc(event){
		|		if (event.target !== document.body){
		|			event.target.setAttribute('bit-contextmenu-selectElement', 'true')};
		|		event.target.click();
		|	}
		|</script>";
	РаботаСDOMКлиентСервер.ДобавитьПроизвольныйHTMLВЭлемент(ДокументHTML.Тело.РодительскийУзел, ТекстСкрипта, , ДокументHTML.Тело);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКнопокКонтекстногоМенюПоляHTML()
	
	Элементы.ПросмотрHTMLКонтекстноеМенюКонтекстноеМенюНастройкиПараметровИнтерфейса.Видимость = Ложь;
	
	Если ДанныеТекущегоИнтерфейсаЗаполненияПараметров <> Неопределено
		И ЗначениеЗаполнено(ДанныеТекущегоИнтерфейсаЗаполненияПараметров.Идентификатор)
	Тогда
		Элементы.ПросмотрHTMLКонтекстноеМенюКонтекстноеМенюНастройкиПараметровИнтерфейса.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПеременныеИнтерфейсовЗаполненияПараметров(ДанныеСобытия)
	
	ЭлементИнтерфейсаЗаполненияПараметров = ДанныеСобытия.Element.closest("button[data-bit-interface-id]");
	Если ЭлементИнтерфейсаЗаполненияПараметров = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеТекущегоИнтерфейсаЗаполненияПараметров = Новый Структура("Идентификатор, ЗаголовокКнопки, ПараметрыПолей, ТаблицыПараметров", "", "", Новый Соответствие, Новый Соответствие);
	ДанныеТекущегоИнтерфейсаЗаполненияПараметров.Идентификатор = ЭлементИнтерфейсаЗаполненияПараметров.getAttribute("data-bit-interface-id");
	
	ЭлементЗаголовка = ЭлементИнтерфейсаЗаполненияПараметров.firstElementChild;
	Если ЭлементЗаголовка <> Неопределено
		И НРег(ЭлементЗаголовка.tagName) = "span"
	Тогда
		ДанныеТекущегоИнтерфейсаЗаполненияПараметров.ЗаголовокКнопки = ЭлементИнтерфейсаЗаполненияПараметров.firstElementChild.textContent;
	КонецЕсли;
	
	СтруктурыТаблицПараметров = РаботаСИнтерфейсамиЗаполненияПараметровКлиентСервер.ПолучитьСтруктурыТаблицПараметровЭлементаИнтерфейса(ЭлементИнтерфейсаЗаполненияПараметров);
	
	Если СтруктурыТаблицПараметров = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтруктураТаблицыПараметров Из СтруктурыТаблицПараметров.ТаблицыПараметровИнтерфейса Цикл
		Если СтруктураТаблицыПараметров.Идентификатор <> Неопределено Тогда
			ДанныеТекущегоИнтерфейсаЗаполненияПараметров.ТаблицыПараметров.Вставить(СтруктураТаблицыПараметров.ИмяТаблицы, СтруктураТаблицыПараметров.Идентификатор);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтруктураПараметраПоля Из СтруктурыТаблицПараметров.ПараметрыПолей Цикл
		Если СтруктураПараметраПоля.Идентификатор <> Неопределено Тогда
			ДанныеТекущегоИнтерфейсаЗаполненияПараметров.ПараметрыПолей.Вставить(СтруктураПараметраПоля.ИмяПоля, СтруктураПараметраПоля.Идентификатор);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
